paotuan_wechat/models/Activity.php

SELECT DISTINCT `act`.*, `act`.`uid` AS `act_create_user`, `au`.*, {intVal(5189)} as act_opt_user, `l`.`name` AS `location_name`, `act`.`act_id` AS `act_id` FROM `activity` `act` LEFT JOIN (select * from  `activity_user` where uid=5189) as au ON act.act_id=au.act_id LEFT JOIN `activity_location` `l` ON act.act_location=l.id LEFT JOIN `activity_club` `ac` ON act.act_id=ac.act_id WHERE ac.club_id=882 and act_status=1 ORDER BY `act`.`act_start_time` DESC, `au`.`checkin_time` DESC LIMIT 9
---
    public static function getUserActs($uid,$offset=0,$limit=20){
    	$query = new Query();
    	return $query->select("act.*,act.uid as act_create_user,au.*,au.uid as act_opt_user,l.name as location_name,act.act_id as act_id")->from(Activity::tableName()." as act")
    	     ->leftJoin(ActivityUser::tableName()." as au","act.act_id=au.act_id")
    	     ->leftJoin(ActivityLocation::tableName()." as l","act.act_location=l.id")
    	     ->where("(au.uid=$uid or act.uid=$uid) and act_status=".self::STATUS_NORMAL)->distinct(true)->offset($offset)->limit($limit)->orderBy("au.checkin_time desc, act.act_start_time desc")->all();

SELECT * FROM `activity_config` WHERE `act_id`=5156 ORDER BY `sort`
---
    public  function getConfigs(){
    	$configs=ActivityConfig::find()->where(["act_id"=>$this->act_id])->orderBy("sort asc")->all();