paotuan_wechat/models/ClubMember.php

SELECT * FROM `club_member` WHERE club_id ='882' and uid='5189' and (member_status=3 or member_status = 4)
---
    public static function getNormalMember($clubid,$uid){
    	return self::find()->where("club_id =:club_id and uid=:uid and (member_status=".self::STATUS_SIMPLE." or member_status = ".self::STATUS_NORMAL.")",[":club_id"=>$clubid,":uid"=>$uid])->one();