paotuan_wechat/models/ClubSub.php

	public static function fetchAllByClubId( $clubId ) {
		return static::find()->where( ['club_id' => $clubId ] )
						->asArray()
						->all();
---
SELECT * FROM `club_sub` WHERE `club_id`='882'