paotuan_wechat/component/PaotuanController.php

SELECT * FROM `club` WHERE club_eng='lzywinxp3' and club_type=1 and (club_status=1 or club_status=2)
---
	public function beforeAction( $action ) {
		$exAction = ["memberpaydone", "findclub", "findclub1", "find", "new", "createclub", "uploadimg", "checkmember", "announcementinfo" ];
		$controller = $action->controller->id;
		if ( $controller == "clubs" && in_array( $action->id, $exAction ) === false ) {
			$club = \Yii::$app->request->get( "club" );
			$this->club = Club::findClubWithMemberSum( $club );
			if ( !$this->club ) {
				throw new NotFoundHttpException();
			}
		}
		if ( $action->id != "createclub" && isset( $_REQUEST["club_eng"] ) ) {
			$club = $_REQUEST["club_eng"];
			if ( $club ) {
				$this->club = Club::find()->where( "club_eng=:club_eng and club_type=" . Club::CLUB_TYPE_CLUB . " and (club_status=" . Club::CLUB_STATUS_NORMAL . " or club_status=" . Club::CLUB_STATUS_PROCESS . ")", [":club_eng" => $club ] )->one();