paotuan_wechat/controllers/ActivityController.php

	public function beforeAction($action) {
		if(\Yii::$app->request->isAjax){
			$act_id = $_REQUEST["activity_id"];
		    if($act_id){
			$this->act = Activity::findOne(["act_id"=>$act_id]);
---
SELECT * FROM `activity` WHERE `act_id`='5156'

			}
			$location = $act->location;//活动地点信息
			$club = $act->club;//发布活动的跑团的信息
			$member = ClubMember::findOne ( [
					"club_id" => $club->clubid,
					"uid" => $this->user->uid
			] );//跑团会员信息
---
SELECT * FROM `club_member` WHERE (`club_id`='882') AND (`uid`='5189')
SELECT * FROM `club` WHERE `clubid`='882'

						$needBind=true;
					}
				}
				$reg = ActivityUser::find()
				          ->where("act_id=:act_id and uid = :uid and (isreg=1 or status=:status)")
				          ->addParams([":act_id"=>$act_id,":uid"=>$this->user->uid,":status"=>ActivityUser::STATUS_NEED_PAY])->one();
				$check = ActivityUser::findOne ( [
						"act_id" => $act_id,
						"uid" => $this->user->uid,
						"ischeckin" => 1
				] );
---
SELECT * FROM `activity_user` WHERE act_id='5156' and uid = '5189' and (isreg=1 or status=0)

	public function actionActusers() {
		$act_id = \Yii::$app->request->post ( "activity_id", null );
		$act =$this->act;
		if ($act) {
			$checkins = ActivityUser::find ()->where ("act_id=:act_id and (isreg=1 or ischeckin=1)" )->addParams([":act_id"=>$act->act_id])->orderBy ( "checkin_time desc" )->all ();
---
SELECT * FROM `user` WHERE `uid`=53175
SELECT * FROM `activity_user` WHERE act_id=5156 and (isreg=1 or ischeckin=1) ORDER BY `checkin_time` DESC