paotuan_wechat/controllers/BindController.php

SELECT * FROM `run_bind` WHERE (`uid`='5189') AND (`bind_type`=1) AND (`bind_status`=1)
SELECT * FROM `run_bind` WHERE (`uid`='5189') AND (`bind_type`=2) AND (`bind_status`=1)
SELECT * FROM `run_bind` WHERE (`uid`='5189') AND (`bind_type`=3) AND (`bind_status`=1)
SELECT * FROM `run_bind` WHERE (`uid`='5189') AND (`bind_type`=4) AND (`bind_status`=1)
SELECT * FROM `chip` WHERE (`uid`='5189') AND (`status`=0)
---
	public function actionRunbind()
	{
 	    //$this->user = UserMaster::findOne(['uid'=>10]);
	    //$this->checkWechatOauth("/bind/runbind");
        //咕咚绑定数据
        if($this->user){
        	$CodoonBind = RunBind::findOne(['uid' => $this->user->uid,'bind_type'=>1,'bind_status'=>1]);
        	//虎扑绑定数据
        	$HupuBind = RunBind::findOne(['uid' => $this->user->uid,'bind_type'=>2,'bind_status'=>1]);
        	//益动绑定数据
        	$EdoonBind = RunBind::findOne(['uid' => $this->user->uid,'bind_type'=>3,'bind_status'=>1]);
        	//小米绑定数据
        	$XiaomiBind = RunBind::findOne(['uid' => $this->user->uid,'bind_type'=>4,'bind_status'=>1]);
        	//个人芯片绑定
        	$chipBind = Chip::findAll(["uid"=>$this->user->uid,"status"=>Chip::STATUS_BIND]);