paotuan_wechat/controllers/ClubsController.php

	public function actionClubinfo( $club ) {
		$member_start_time = \Yii::$app->request->post( "member_start_time", null );
		$members = array();
		if ( $member_start_time ) {
			$members = ClubMember::find()->select( "id,create_time" )->where( "club_id = " . $this->club->clubid . " and (member_status=" . ClubMember::STATUS_SIMPLE . " or member_status = " . ClubMember::STATUS_NORMAL . ") and create_time >'" . $member_start_time . "'" )->orderBy( "create_time desc" )->all();
		} else {
			$members = ClubMember::find()->select( "id,create_time" )->where( "club_id = " . $this->club->clubid . " and (member_status=" . ClubMember::STATUS_SIMPLE . " or member_status = " . ClubMember::STATUS_NORMAL . ")" )->orderBy( "create_time desc" )->all();
---
SELECT `id`, `create_time` FROM `club_member` WHERE club_id = 882 and (member_status=3 or member_status = 4) ORDER BY `create_time` DESC